app/Controllers/ProductController.php

     public function readProductApi(){
        $products = $this->product->findAll();
---
SELECT *
FROM `products`

    public function updateProductApi($id){
        $requestData = $this->request->getJSON();
        $validation = $this->validate([
            'nama_product' => 'required',
            'description' => 'required',
        ]);

        if (!$validation) {
            $this->response->setStatusCode(400);
            return $this->response->setJSON([
                'code' => 400,
                'status' => 'BAD REQUEST',
                'data' => 'Invalid input data'
            ]);
        }

        $data = [
            'nama_product' => $requestData->nama_product,
            'description' => $requestData->description,
        ];

        // Check if the product exists
        $existingProduct = $this->product->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'

            ]);
        }

            $update = $this->product->update($id, $data);
---
UPDATE `products` SET `nama_product` = 'Lemon', `description` = 'Enak'
WHERE `products`.`id` IN ('1')

    public function deleteProductApi($id) {
        // Check if the product exists
        $existingProduct = $this->product->find($id);

        if (!$existingProduct) {
            $this->response->setStatusCode(404);
            return $this->response->setJSON([
                'code' => 404,
                'status' => 'NOT FOUND',
                'data' => 'Product not found'
            ]);
        }

        // Delete the product and handle errors
        try {
            $this->product->delete($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
DELETE FROM `products`
WHERE `id` IN ('1')